{
  "irVersion": "6",
  "producerName": "pytorch",
  "producerVersion": "2.4.0",
  "graph": {
    "node": [
      {
        "input": [
          "input",
          "base_model.conv1.weight",
          "base_model.conv1.bias"
        ],
        "output": [
          "/base_model/conv1/Conv_output_0"
        ],
        "name": "/base_model/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "5",
              "5"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "2",
              "2",
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/base_model/conv1/Conv_output_0"
        ],
        "output": [
          "/base_model/Relu_output_0"
        ],
        "name": "/base_model/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/base_model/Relu_output_0"
        ],
        "output": [
          "/base_model/MaxPool_output_0",
          "test1"
        ],
        "name": "/base_model/MaxPool",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/base_model/MaxPool_output_0",
          "base_model.conv2.weight",
          "base_model.conv2.bias"
        ],
        "output": [
          "/base_model/conv2/Conv_output_0"
        ],
        "name": "/base_model/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "5",
              "5"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/base_model/conv2/Conv_output_0"
        ],
        "output": [
          "/base_model/Relu_1_output_0"
        ],
        "name": "/base_model/Relu_1",
        "opType": "Relu"
      },
      {
        "input": [
          "/base_model/Relu_1_output_0"
        ],
        "output": [
          "/base_model/MaxPool_1_output_0",
          "test2"
        ],
        "name": "/base_model/MaxPool_1",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/base_model/MaxPool_1_output_0",
          "base_model.conv3.weight",
          "base_model.conv3.bias"
        ],
        "output": [
          "/base_model/conv3/Conv_output_0"
        ],
        "name": "/base_model/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "5",
              "5"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/base_model/conv3/Conv_output_0"
        ],
        "output": [
          "/base_model/Relu_2_output_0"
        ],
        "name": "/base_model/Relu_2",
        "opType": "Relu"
      },
      {
        "output": [
          "/base_model/Constant_output_0"
        ],
        "name": "/base_model/Constant",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "2"
              ],
              "dataType": 7,
              "rawData": "///////////gAQAAAAAAAA=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/base_model/Relu_2_output_0",
          "/base_model/Constant_output_0"
        ],
        "output": [
          "/base_model/Reshape_output_0"
        ],
        "name": "/base_model/Reshape",
        "opType": "Reshape"
      },
      {
        "input": [
          "/base_model/Reshape_output_0",
          "base_model.fc1.weight",
          "base_model.fc1.bias"
        ],
        "output": [
          "/base_model/fc1/Gemm_output_0"
        ],
        "name": "/base_model/fc1/Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "/base_model/fc1/Gemm_output_0"
        ],
        "output": [
          "/base_model/Relu_3_output_0"
        ],
        "name": "/base_model/Relu_3",
        "opType": "Relu"
      },
      {
        "input": [
          "/base_model/Relu_3_output_0",
          "base_model.fc2.weight",
          "base_model.fc2.bias"
        ],
        "output": [
          "/base_model/fc2/Gemm_output_0"
        ],
        "name": "/base_model/fc2/Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "/base_model/fc2/Gemm_output_0"
        ],
        "output": [
          "output"
        ],
        "name": "/base_model/LogSoftmax",
        "opType": "LogSoftmax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      }
    ],
    "name": "main_graph",
    "initializer": [
      {
        "dims": [
          "6",
          "1",
          "5",
          "5"
        ],
        "dataType": 1,
        "name": "base_model.conv1.weight",
        "rawData": "15McPlH8KT6A6j+9sSE8Plh9M72UTiU9c2rHvQ6N8D09ijQ+Pj8WvukCMj4oUhk93U4XPrDj3TwWgcU90FPnvJ/gHT6QK/I8tze/vQzQUD29t7y90CPAvMpcpr2/2wc+u6khvnDUvL1IUme9/Uf2vSijmjzVRkq+7fQ4Ppr4Lb55HB4+oFQIPbz/hL3CHP09kFj/PI14JT4AHLM8Ri2BvQwbXD10Jl69HmKsPZnZNj7yxew93RCzvZZy7D2MkxI9XgLQPT2n+b23u0q+10CevRYWHb7fCyg+jPRrPXKpqT1iioE9QANkuzdHID5ggxG+0FFOPMTIC74cmnw9Gg+NvSQEez1grCq9BdwpPk3F8r3dSPS9o0z0vbU0OD7qf4g9pxFFPj4EKb7gIku+ZTogvkjECb6K56U9+qqSPV8sKj4gh9O9VZ0LviZT2T3qj6W9kpj4PYxlQr1eT+o9gB8fvl20zr08wXk9YC8tPbjcUL1qJvQ9lTkLPviDFL4jrNq9D4c7Plw2ir28NZG90ylGvtOQ6r2go0w98EHYvFWpFL7AuZk7JeULvmvALb4qjeG9Uj4zvmpnAr5LuEw+9LkaPcRxfD2FAz++3YEGvnZWiL1oGQA9ODU0vlB8sL3zNvW9AEsROtppmL2AEWO8UMcKvuCSDL4d9u69fDSMvQ2lIb75tys+7JQivZE1MD6EP389jWwtvpO6DT4MZmG9pwKdvZr/Kb6nmku+xGFqPQDzMr1+d589ZhIovqsMGD6OVRa+OHQNvSgbKz3udNM9UVYlPoGQOj71YyK+"
      },
      {
        "dims": [
          "6"
        ],
        "dataType": 1,
        "name": "base_model.conv1.bias",
        "rawData": "dCpOPfotsL0wi7O8cEoZvjmLOj4lUBa+"
      },
      {
        "dims": [
          "16",
          "6",
          "5",
          "5"
        ],
        "dataType": 1,
        "name": "base_model.conv2.weight",
        "rawData": "hL0yPZwR6zzIWtk85s80vVj+lz1A/JI8iBYsPLNck72OZAw9mLBIvLY2Gb28oY896B+VPD8JOb2HRSm9YIp/u5i8Oj2A66q8RNI+vRgN5bx42Xm9zIruPBBvgT0fbZ29sFibPHbELD2wknI82DPuvIiOLj1GwC89OBz6PCgSa7xiHrG8EB0PPJhRbLw+U8e8QMZVPSC1jz34bgS8QMKVvIAqnDrQv5+7DM6gPORwuzyZ4Je9+tb2vNTRjD0YSAI9oBKFu06iSb06nEy97smVvR4H2rys4eE8iD5VPaBoGj3Sz5O9LB5JvXAeU7w8wqE96INBPAQ4rbyYXAo9BMP+vFx3WL3wGXQ9sREYvUQWhryFWaa9MNRfPYxhfT0YxfM8vjFpvd0Ipb21z4e9yGN5PayQID0St4w9lDMvPWxJqTwAmlG6ZFd+vaZEj71YaJy94ucIPacyJL3UnIa8Y3hAvejEc7xwY2u9woZavWzf3Tx2yca8YHZOPaaU1rwAVXW96AdsvBMeIr3qosy8+DCfvUwdOz0q1mi9DhgoPSLDFz3I7m496kOAvaiGcD0LGx691DL4PJAJnT1Aqjy8AIclusj+mbz3n4u9Tn8gPTQApr1Unk899Dt6Pb4jnj0Sxp28zGSJvRRiljyMwDg9HW+mvdDSl7zoeki9QALqu0qdJL3+tAi9ClfUvI7onr08NIk9PC+MPfDZUbxwWBi8i30IvUICl71OuqK9uJf4PBGfN716AFe9MMDQuxa+3rwIZdi8AO8rO2Dgjbw4Tea8YyEgvUYWiL3ENow9X9YFveg8sTyUE+i8EGrZO9zlmz0uFRo9WOmQvS69BD0gu549OPivPAA3YD3Q26Q9WPtMvOjTijwKcmi98NaJvLytdz2gcis9yaBTvQsXhr3IimS9MwalvUYIgb0qaaW8NLRhPVDqXzznX369jSWGvchfJj2gxHi9qLYkvHRuID0PyBq9MN4RvCDj6LuUPp68AJIpvaMQlb0YLIe9BRQzvYaBoT26iSG9dJVgvZQhojw8Wbg8xD03PWA2fj1EPTo9HcylvUBJ7TsUlko9sEj3u6cTRb2Cap89ci36vO5oPr22wZa9IAVvOzozFD1YEJQ8CEWEPAGifb3JKZy9gHS8Orx5mD2g8UA9f7hCvbCmLbyeina9G1chvZBDcjwkHTY9yISKPTqGmb0UnF89NOBrvbB4+jwEgo09AEiWOgwjmD2Reo69inv/vLQPQz3kuZG8LOuIvPxjC72Mh2Y93AokPThX1jwD8Tu9U72HvRCxEDxYLMY83mkavT4mu7w03mE9ECHVO4BtcTs6nKS8bW6XvXs6nb2u3R+9YgAqveBj0Dxot8K809YCvV5unz3w++g8wGtuPbznIb0+mwi9mNb1PLrTXr1yn1q9wDmBu9il9Lygtnq91F9GPY54hj2QA1k8cOtovNbjmr08ofO8JEmqPIiyHT1gHSm8ezgEvWRbOj07LIW9xF5TPRi/Ab1AzKM6HC6EvOgvIjz2Icq8nC1zPWAcC7vah4I9AMegPUjvIr2Q+XO95CiGPeYIgz3FW3+9INPOuwjmpL2K4oi9JDCBPJTxsTzkyY08Pgu2vKZFmj24RD88oFhFvVB4l7t8oKA8HDzqPFh5bL3gr/o8ldsqvdjyir0HrDa9YEShPbTyjj3YvZU9fFFEPXimfD2oDjO8PgQ4vYgaJz2sTC29O7NhvSCY1byQXow8xCosPfrlAb2e1kS98HM0PNcgRb0yvVm9cFMuPZi4YLxAzZg90qqiPVwQyDy4MuY85AeaPECapzpwmMK7wBaTOizG+TySeZs9RFitvC9fDb1Q+qG8G5MhvRB4YzzUo3k92MKCPW6MGT1sH3a9c34zvZT1krxIlHa8sA3cO3eAmb38LtA89iF/vf2cU73FBYu9ZrORPYpYnr3ESXw9QOIzuxiUG7zkLlE9MEr3u1i+UT2QzXE9SC6RvZ6vAD3oiXw81NCPPMBMQzww9bY89eIgvSgnK7yu4J49/LBgPUAHSbswRp29oIVqOyW+Y70O+4c9UQhLvdAswbugc5S8sA5uPHRbnT1AOf47pLFBPXLMgT1U/4Y9Iv/mvCCZlbyGLSE9nIO2vNSaHD2cIJK8K9VivWAhCD3YGU08shsVPRYhpj3IVGQ9HoWePUAzjzvt14+93p1qvVa+T71tXJO9v6InvZvvmb1CR5q9KNhHvYTZpL0XSE29KAz/PBR4iz0U98a8ro/CvOCSMj1hACW9+SEevXgOTj2gspG9qJIjPMK3kz3gZ2U8bOW1PO3FQr2AppO6UByTOyQqpDy08QE9Ak2RPY1Gf73AZSA7zBgnvdBHhL1QP9a7IDGTvUBnaT1Y7ho8Xj80vRDFLj2hQp69J1wBvShPgrwPGI69I6pUvWhYWrxMwn09qnmhPSjKVD1Ls0e9uMtavTLukT2ol+w84CkOO1AKNTyaZIa9ylPfvLL3oD1E96S8wDaGu8PYir0hFju9wIfauhy9T73A5CW8KhoIPcGRo73oqcY86iFdves4I73EZAA9dvWEPR7Ptrw7Twm9eTSXvXt0LL02bJK95BWZvMR8iDy3qZy9MACSPaDSUT2nsqO9+LwfvSAo2jw0bYm8eMgRvOkAF70sUIY9H/M6vaKrij0Qoaw7UHWGPNZzgj0waly81Gg+vRBcWLyGn4c95iV4vUTSlzxGV6S9llgvPZwg9zxA12I7wIkPPQCYwDjIDzk9pF+EvaBzRLx0XBQ93oSmPf5bKj2sMXO9dJuAPWAolbx00I68jPyXvaiUUrxojmw9wIo6PE7LQr004808gHjWvGSrmD1ZI5G97EfTvDZ2ob0etgO9aNzSPIz3oD2Aq2A8IO+jPdzdgjxAJkE9gg2GPSjIiz09MTu9ML2ZPSSXSj0wYBy9L5gfvf9AjL2s+qc88YmHvUJGDT2YOtM8oUeRvcxEtjyAmdm72sYYPYDlPz1MPaa9HFuZPYg8jD0oEQU9ytSYvYrv7rx62MG8NuarvMSYPD3ULvM8jneEPUKC+rxMGuE8bPvtPH85i72MNKK9JIktvSTwZD3ybZ29eo2RvRBaOz1AcDQ98ISJPb16fL08xnS9zo8rPRRrkT1MG0g9oI9RPKhx3Dwotp49u8dXvZ7WF7147Wk9xtVkvaxpOL3UInQ9ZAvTPNgX2Dx4vw29QLGTujoLmT1evEi9gEgoOt4OHz104Wa9FGaiPZgWJ73qnqC8OPq0vFjwWb3qFaS9pJI8PdizsTzznZy9rEBXvQBGpT3Iqv886jAGPdAXSL2qnRK9SPBJvLCldLwkLGW9sGvcO8D0BDwQYym8WHQ5POiNBL1kE648aEL8PDgpML10z6W9TA4vPRCNnzw0Fyq9GCahPZs/F72o/mE9YKspPYYyjL04sVc9vcCZvXRIOb3IBV+8FW1hvYBboz2cKYa8wNUEPbhPlb0whkA9DODPvIllfr0InEM8ngUiPd61kD2MRUy98ZMkvYSZgDyIcLU87pQAPXCQNz1wq5e8lM05PdyTdj1sua68CPBtPSpmIz3cfpM9RA0+veMlJb3EZcG80LeHO5C6SD3o6j697m8nPUa277xYCUo94Ax+u3p/kr3IBTi9qgxyvUTeJT2SQWC98Oreu0BQkDxKZze9PPPAPKxGo73iSm+9RoWXvbpRyrxIq/O8gI4/PHhed7x8Nh09Hk6ZPXD87zzfwQO9vZScvXhE8jwQsyW95C8qPeyQXz3M/wA9JuecPdTSnj2YoI084K5zvWJmlT1fsB699/gdvcTsiz0IkIE96BnKPNC1pzuUqIy9IN0KvDhioD2sVao8EBLlO3TkiryaSum8AFVHPXD+pDt8k1k9kMdsvF4eEj2oCwo9qFJVPLQmUj3YklE9rP+aPbaNgD1iB6u8EJKNvVCQdDwA0jq6lnWuvCADYLwgrHs76AN0PQCE0Dxsg+28Y4cJvViipbzKQgG94F2WPQwiMT2G/pY9ALaIOXTkhjwg8ec8/EeevaDp7jvA9rK744A7vbTAgb3GCJQ9rvWHPUYAGz12kZ89mLcHvTgPZ7yIP/08EAhdvKBBg7xkN4q9WLOzPAEcSr1gmEI7sgijPcLjzbzW0tK8KMVJPejp9bzAw+W7bCOcPUMcCb15Qm+9ZCo7vUJxubygsB69zIwtvRAYBz14VWM8tBTWvPnpgb0CmtK8QCUNvQ6q2bwG2pa9TBiQPAC4db3JOoK9gZ+IvayWCz0LV0m9BgoKvZoSgz34kjE9ZMM/PWrGnr0g02+94IH8vIgjij0o2gg83h96vQAHBjqt34G9wIySvHbst7wwwZA9xCzPPMBDabzw+2E8tBTBvIJmAz2MSgQ9oJ+zPBhbAr2gqY49cCFBvLAzAr1sdlE95kqIPbxopj3UKMY82gPkvJ7bKT1Ed489fAOkvcC6JbwSE2S9aE15PG5RCj1oLoq8ENPfu6KIFj3A1WC8Om2MvSzMhT22Uyi9iPYSvLBe/DvwyaC71EydvZBwGT1t6Re9f3UtvejNnzythy69NJAavYhg4bzuR/u8ZqwLvchitLz80q0881CHvZptSr1AKJw6wAk6PAC1OD1a7Gq9qIDVPDAXPj0Yszk9PMCbvcI+/7w7vI+9tKJTvZRGOj1QwEe8CAoOPRBRRL24SEs8cUlKvbAuJz2WRhK97LmnvIIVkb0Aa405SsWePRRUIj2UbzK9gO2POpiuEryRn4a9Uh2DPQCGrDro3Iw8LA4HvU59HL2olFw8QEr3PPAGljwlLiG9IlqiPSDsRLx00Ey9oWscvQadpD0AAIQ2cJc1vA4uC72eV6+8EdaMvcLihL0UvkM9BgyPPaKTnz25cXG9fOI0PV4BT70Ig0c9gFBxPdJngT3Uz3A9ADdRPcBM0Dr+qhk9vk3vvCKgET04+ta8gLOzuiCLkb3C5K68E98vvQig4bwlkVW9WmeWvRA4rjvsClk9TkuYPYApQz3oWS29eGGlvZS2/TzEYzs9IY+PvVTZ7zwiYY09gBKiOwp8Sb02GYk9WM8OPfB2XT3GLGK9yJ9CPfJxZL02dqU9bLMNvVCFST2474U8NEKxPIAmTbx4XQk9SmILveCdnb3ifQC9rAWDPSAYsLxMPdI85kz3vLDgej1EKEg9JB/sPI7zKr2lo4i9IHZJOzgzRL1sfIk9ZLGgvQZzFT3Ws6Y93H4nPWQS5DyD46C9qtigPZDRZLwZQJy9aBKlPboXCL3wSL27Og2ZPfzUZ71gnGy9gIpZPBgQM7zUEZo8Pj+MvcAHIDt+vhS9hmkkvYccmb0cUzE9fNmAPK5fjb1SsoQ9EL/JPKA8eDwyXES9CL1JPCwfoT2YYmU91D2Cvf6jmD2AYM87QNogPerfgT0ojo49R1qCvV5tkj0oJGO9UJLIO0Kxab20o5K84Clzu8AKILz4VFO8kATTO47ypD3QT0I9hBs7PYrbBT0YdYE9YPF2uxC81DsAp4k8HNaRvTu0hr2AAiQ8PNkCvQBhxLqkepm80DxQPASXWT2g0928MuuFPYIHhD0DV4C9aSGBvdRKh708Rze9OjACvRBiybs6qqK8TPkovTp/1Lwm9vG8OAykPWzn97wMdW+9UAYLPXCKmrs2BIA9mPdQPeKgmT2a7XS9UP9WPRRWjD3RJyW9MrSZPVi1ej0AZmo66D8hPU7a6bxk2JG9+BOpPIRoxzwGk1q9rDMiPYPXjr2K6Y89zO6hPUgbtjzd1VG9yMIiPTD5Yzwg4bU85NPbPCCgfj3HwA+9vHWWvOhntjwwwxE8XteGPcGoL72A3UK7aPZ5PESlsbzE/WM9MFMSPGGMmr0Q7RC8rK8XvZj9ATy4dxu8qN6lvYjFc7zoIAC8kDzFvBijmT2g8pG8HNlWPSSxpTyZJ429FC2dPHaUij1mwVq99StYvYKuoz2aXIY9lZQ6vew+ST0QJCu8mt2kvfAEyTv0G9g80qLIvLCw6Dwb/Y69LMVnPTyPjj1Mbjg9mLxiPABL3Dwu+3G9QiKnvFBs/7sMHDq9mgV3vbzyYD3Q9mI9qt2XvfzX1Dy6DAg9MNqePWB9QT3oupk9hPvavDA8aj0IBIg9veidvTg6hr08Yoc8gJ02PRYnJr0IVRM8AJT4uBBMqTyotTO9sKI8PVxnXj1IDWi9gFlPOgCMbTk0ydY8NsebPQQoxDyc+5e8OC+WPU6H/rzeOMK8oKu2Oz6tfr34kRE8RuhivVCMCTyYKgA8CCw5PL4Djb1O0p69WuEZPepnjz2VYpS9QL/3PLAvdr0Au6c7spKbPdi1fT0shXS9lN9OPaSuLj0AUgO5Mv2hPYDUBL1YqJu8eQcpvWh/QDzkG7E8IC/VO6sqPL1ljRa96ITjPCGfkr1oVVC8ABHtunaAB71UavM8IHKsO+DLaj1gne27eBNTvQxMbD2g0Do8dpC/vKptXL3Uxpw8LnyfvaQqsDxSXCU9Ja+SvVryWr13b3C9WoyMPeonjj0Afac7WPycPXSb37zmVqK9YKLpPAj27Dwm8KM9AEDGt9YngD1w/0w9HA5yPbHvpb2Ksok9wIuOvcrplT2gv127IDGUvVACujysJYi8zjGWvQ5+8rzA7Qk80jyCPbihzbwUpUY9MIYnPOBeNDuo+H88BXtbveL9ir0AK9K8wNKbvQP3G71ALXY7aENcvR+5Cr0IYHC88BwavDadOL1wj4A7WMQ7vIhLvzzAsHE7+gEnvVhI5ryAsna6DK9QvYBz0TvQ57y7IMEBPbBMnjyESXo94GUwuwQed70QfxU9dAZivWjgN7xOldi88sz9vP5497wYqZk9ZHM/PbheuTzMAp09fomXvYDeVzxEGVY9xClePdsUhb2YC+48KYY+vWAVUbv4kou8HJ+LvRyDn72CBly99sEXPb77GD3LcJG9xDD7vIDPrjr/kpC9qHA8PYp0lz2wmGw83X14vej4mzx0z/I8LGmEPaLxMb0N0JW9Yu8SPRCRpjvU79m89iIMveZwLL3mXIc9WNBmvMQycT1+RJU98HUpPGB7jjzANra7TLJlPbetlr36/wQ9MPVZvJq1GD0Aq765UKn3vPBoELz0lzQ9yUZovbllU71M05W89p3yvEZhAz3oEGE9WEUPvBAenj0GvAu9J6w7vbi5Fb34ama9EGtqvYr+lL3JM5S9QJOuPDD1Sz0e/pw9sG+OPYAXmrvwyoE8rBlIvVhEAT0CVqC9sL4dPSBddTxAjM08OOj0PKiKGb3EfY89ZJwfPZywWz0QsDA8oAVSPZQTYT0alBc9gMN+PVCjcryI51s9pBuaPLw6ST3e3qI9OHWXPJBD+LzIGQW8nE68PIiOYTxmt7a8zgSDPaTuSD2evE+94ADau1hqALwbmlG9AB5DPO5WzbwtqCy9EBPXvG587rzK95892kcAPdyPpD38Zrc8OHSXPCR8CT3gmWU8cjqDvUDFRb3IDaK8wOKgOnz5+zw+xgA9HKiEPSAqiDw8SOS8ZIF7vfvxdL2SxUe9HLzJPOCvND00TZI9nJLTvBAN07uSoca8AGycuaS11jyAI+u6ILl3O7h5KTzUGfk88u/KvItsR73IzZ08mGUevGOCF72Acww9gB1COliYQrxB5SG9iAAwvKowjr2QKZg8wJmgOtTySj0Awqw7cOnVO8A1tjxYfH49cAoevRypRz20lKM8yRtfvaTk6Dy1kki9eIzSvGtqH72yhWO9TrKDPaF2lb06OSc9p3+WveDPIryQkp87PMFtPaoP8rw0hcA8oDlPPBTHRD0AEJ870HT6PMMHSr1qZ2i9MgGVPXexc73gvGO8CLUhvAiFoz2AjZC8vpt+vRCPqbx6giw9vIgEPapWij0I7oi8+IgdPfxbnb0waAE9ZKkZPbC9Vz3Cxz+9LJOyvBDSoTzmp2295gSFvRLfoL2QWpU7bK5PPZDOqzyQHKM7lA3pPF8pUr2ICA08ACqmvCiYJb1qNJA9el6BvXALRDzf75K9oIo1u3KcFL2AKNw8kcw7vYwNVj06sYe99N9IPeM4e72cHjM9+NEMvQB0R7nIJHS8SA9ZPVw12zyLWpO9kPz1Oyy3Zr0gA3o9qMpbPIYFrLyZniq9RITnPBlLSL1gnB49eH42PVBHTT04vK48vGCSvfiQcD0cgM+8Pr7FvOi5D7zAhHQ9KpSAPYCQTjzGkx893tibvQBASjl775O9qKbjPPxEbr3MY+68LMhpPV7Pnz0Yyki9v505vcCsJTwOeAM90OFZvATi0Lw+rFu9VsMOPZbVoz3c5CG95r0dPVZWIz3kaIY9yE4YvGCLKDvktXU9/GZTPbQppT3mrb+8DlUEPYiHaT1sBWO9tOCEPJSplbz4+1Y9azQWvdCnuzvkGEg9FDGZvWcxjb0VSyu9fINWPdQ/YD0UaWS9cBd/PDc2Mb3XOhu9UDaQPUCJIT327La8KOtEPFiZgTyArZw8/PDkvPTxRL0sa109uMEzPH76Cz2MUv28uP0hPUxkcz1QZUs9MN21PACGpD0APju5vGaOPBrhnj3ohKI9vzQNvYihlj3M2vY8kL4VvJQBkj2GPy29zExZPUa0pT10qWa9UllFvf2ypb2QvnC8U96XvUYF4LwkEcs89GdsPRBLOj28ozk97r4KPdFtT71JxYS9gNFdO67Jnj1QpZY7gB7mu7L+Yr2h0yW9FeeAvfbihT149Vm857iTvaiBDzzgJ8I76EYlvMhu7zxw2jM9BUGdvc4agL3Qh4C72wibvQLll72Uo5M9MH/Lu6pXJb1gb+W8H42Cvdh9gj2wCZG8fwg8vS6kfb2geUM9OOs4vEiKDLywVK68vnAhvfD4bTwqp4A9RNVBvbAwgDsDWH69CdEcvYbHkj0AbGA6tBWhPQhharxvSDa9e9JHvU41lD2/loC9uoIvPSxFpjy8Y8U86LM8PSb+rrz87049DDqFvWhW67xc0nQ9HILGPLgmMrzcM5y8TDZMvUxeSz2gKSq7gAs1uzAvnjwYzHY9y58qvcZb5rz4n2I9fOE8PZKFJL0vbKW94Cp4PODgLz3sw588kDhtPf2uhL3kpig9nulPvTA5PD3AuXg92NfTPNBKhz3WcVy9Yo6VvQ7IoL1Y+FE9MFDqPKrldL0g9iE9fJKYPTXkpL2Qm3I9oCxNPJDg+DtKdpY9cm6XPVrqDD0MIIQ9TCILPYj5WTym/JK9QN55PBjvbb147M08MAZsPIBt8DrcqWS9G7xKvewxdz2Q4CI9GFQwPRpPx7zwWma84GqrvHj9ZT1VXxC9bKZSPZyXZj1C7pi9gLQCOmDHfrxf4ji94GEQPZiHIry0ZpI9UVNRvdRjGz0axY69iKAnvfCAtjtCHoQ9hicwPfpMib0gLRQ8sCVFvWDbZzsmTou92jrEvBBhZT3UbZm9D26fvcipczxoYjc8oKd0vGgEkj1fXEm9tAdLvdL7eb0w/Hi8MLOqvJDuTj0AOpa7eJvVPD/6Cr16pYc95veMPXbBlb1+5qu8bOKNvewTDj2UGJK9MyAevYQUpz0frp+9yL92PQAG4ju2toU9JLkpvfSqWz2AZyE8YMfNO5hDZD0c8p69ta+GvVh+oT0J1Ei9lBBxvUDRgru0G9a8EAU3vGYRYL2kV/E8cuOPvUCy2DtAKEM9zIOAPBC/MTwYqkM8bvLDvLDWfrylBw29+OthvdoRMb0+TqU9gOFfvMxN6jwASGc9AAHRuyDrM70YmGK9WGr2vNy+7jwS04y9sFUjvERu/jwUbYg93EjJPPBHhDzU82Q9DooaPQxK4jzQYc+8oxeGvWx6kLyAnnK8IHvEOzggE7yENQc9CEBePWqWB73Eqp69DJYrvS0FIL2Ekj09+blXvUCm+7u0wo28CvtKvWKYFz3ETwu9wGiKuzYja73I7Aa8MBM+PEC/Wbta7Pm8JLbGPLxNrbxZaTm98J92vfCvjby89529csuKPRXFH73HmAq9AFL3O/RkrTxwR/y7dG5lPb71Qr0stu88ABhBuQUHiL2XhgG9SDiqPNiQfzxULnM9bLxfPdpoNr2B0A69ONSNvPiYb73WlrS8SdaIvaRm/jxQomw9ENbTO79qb72WRX29MDICvVSLwjyAhQI7YDtzPK6ZnT2cUxs9sNKPPPBTh7yANB49hLP0PIWDlr0RjkW9QJwzO5TM/TxetCI9TRVHvV7mpb3wXou7gO0YvAgYwjzU8be8SK9/PTCFsju8OHQ9kN9ovW7JBT2gZh88okQnveLLJT3Xi6S9zjCHPfCc1zvAKQE8sKgaPWAZ3jtiWw89CMZUPdGBgr0UQF09EFBIvMiLm7zMoYY8TsqCPRjONb00Y2G91I1PPQcTHb0UWNc80BVFvAwcuDzENn89Cn4pvURKIr3sFCQ9cH2SO+g6E7z84ZK9Yq2NPaClSrt4ZXa8dEgJvZD+g7xAjCI9gPf1urgBjz0QeJq7EOk/vATGPD3AdQq7qICFvDSO3zyq34M9zOqmPOTfaD1culg9+Ce9PFCP6DzI1dc8oMIKPEZCjj2+XZo9jBzuPECchbtY7ZU9TCaCvSy9dT16MTE9DMFWPdCSzbvUhXm9IJFuPQY8Er04/a88QHk9PR1FnL1wjrE7CprtvFRebT3B71S9YA9LPXyLUD2Mgzg9JoigPXiaSjxPkJe9LL5uPeDu9DuAYdQ6YkqfvWhVlrwwUyK9kMajPfggbj1wfHk95AhlPQxPT71qoQ+9zOECveIRBr0SK4I94ELjPFAAhj1AUHq7KBCVvU4OwrxgCms9bJtLPXgQzzwEM8S8sROcvbKzM71wXi491OUGvWD5Hz1QobY8+XMAvcSySz1W7ta8QMYxu2jI/rxknp69MLJXPLhIwTwAYii9yChNPRkBlr3aMaG9jpBOvYgq57xYkRS8KEKBvBqiGD1VwZK96PpEPEBVuTp8q7A8hDqmPSjUTT3oLTm9EgeJvV7vobw7wye9IKTpPIA1RDpuf4Y9cl4DPeD4dbzA6Tc7nC+gPFj/Jbw074Y9ir+Cva4BIz1RL1W9Pn+SvUxRibwK+SI97ExsPVDZpzyQPee7kPyVuxSTB72QF/C7UNy4u/RLjj0wukM98M+FvQAVsTm/s029+FpUvGLmhL2Y4a08uidxveYUpT1UkXw9czZmvSFunb2AyFA7ore6vPBbxDyYYmK9HOYIPVRvkL1+gTC9a9AvvcjUIT2AGAy7p7OgvfEAP70NxRq9eSabvWBLKzxcWO48aHJ1vGUWBb0AzgG6kNGEvaOjS72AEvS6mo2UPTKvzbxSxCU9KZ4DvYQNsrzILp+9vImKPUbToj3AxuC6vH1UPWbGiD3oHiY91D0sPcEwn71dIZ290liAvdQ20Tzeo5C9bEp/vUIaIr1zH5q9ALjmOJD+QDxytkO9UPpaPULv/bxeTry8nMx+PdKQjz2Qdxm8wxVwvdbGJ70IWSo8ZAtEPWh/Jj14rhO9MhWevT1Xkr10ztS8QD+GOpA4Fr12OIS9cPsMPGi6hL1AaYC9ivCHvUI/tbx2spM95rwCPZCdHrxsqYk8Bi0FPQBp+TnJ34a9BQ1OvWIzY73A3we7dRKZvRg7c7yolvS8bhqkPVTrhz1MQkI9QAyWOy6Q2LwonKo8jBJnvYSjDr34XYa8tCedvA5onr348gQ9krOJPXB3OL1QTrQ8+CQbvOApQ7tg9Js7nOiQPeA+Mzw0l1O9YprwvLJhIz2kudA8AADQOkiNMLwnHwK9zmbtvCxpML2oNFs8FNm7PPgLgD2MG5e8EIm/O6QkWD0aehE9WOIrPNyHzTwg4Io7THCPvWBJTjuoM5K8ZOaWPaLvlj3EsoQ83nWVPcw9LL2IV5E9APmPPUCFTLvGMYa93NfXvAzgsryAxrA635uXvTjrdzztFgu9YEKrvPC7LL3YOI28z0ybvctOMb3gevY7BCZbPZ71lz2a/Hy96m8MPU+FPL1CSYG9AKJru0PZP70uBJC9lEWcvdjaX73QaIk9qIQ6PctiBL162F+9qKGAvQN+Rb3Kngm9+NtIPbDk2jz64QC9qDxmPW3DT70dO4i9XPuRPKxoOL28R748aqyNPTYoHr3IX2m9qMP7PN0Fl71KMJU9oPAdvdavIT2q94S9ql5ivfBbEzyYuO08EqmBPdDZiz1A35m7mP0rvNghXTyYX5u8ACc2Oy9dnr1bRYm9WC1lPTVuQ72iroM9OM8SPHjtojwu+5c9twI6vZAsU7wQAm087IPkPEy9or3wuu086DlFvZi2LzxkQ2I9kEIFvCBHKbuQ5se7eoqLPQgSPj3Y92A88ERJvZWcNb3eMoU91JlwPXSkQT0XYoK9gjqCPYDB/7sYZnY90DyRPcihEjxXKgu9UkudPSdILr2shlo9G1igvZZe0rxNypG9PwUWvSICDj0tom+9epyQvWAibz2EhzI9gA5qutbDa72INbG8gpHYvIyLTj2ax9q8aqXAvJoRbb0GhB29nBQ1PRR5Vz2YW0I81PX6vKCcoD24BYQ8bRcBvXLU57wQODu8SI4ePQin9DwkdHI9YBlxuyJOij0V2Ae9qgYavXAD97zA4py9sIlbvdNPl72QHZ67AMlJOtqZrbx8jGS9JreXPfaf3bx+YB89xOdoPS7YW73YPye8LEtBPUIYoj2QxSi8QFdyPYE+g70CTFm9eIKJPaBQ/bvuMqU98I3CO6+xCr1cz5491jqSPVBN+DvNvEq9gK5nux7WIL2ssnM9gOB3O/TPjDwI00o9EI/dPB3HUL2Y6Yo9qHVNPcl1Tr1o3nw9CMO9PMiqg7xWLW+9iPZdvMLyo7004j49mDdyPUqRwLwWBZs9oq33vFgWZTwyEWm9"
      },
      {
        "dims": [
          "16"
        ],
        "dataType": 1,
        "name": "base_model.conv2.bias",
        "rawData": "QDtiu34wBz22DRA9oG4zu9ykKL1AxGk9WGtdPbiuVjyuzBm9gNGNPADwZDl2xZg9oD5GPABczjtA5bY7bOwxPQ=="
      },
      {
        "dims": [
          "120",
          "16",
          "5",
          "5"
        ],
        "dataType": 1,
        "name": "base_model.conv3.weight",
        "rawData": 