{
    "irVersion": "8",
    "producerName": "Test Generator",
    "producerVersion": "1.0",
    "domain": "ai.test",
    "modelVersion": "1",
    "graph": {
      "node": [
        {
          "input": ["input_1"],
          "output": ["relu_output"],
          "name": "relu_node",
          "opType": "Relu",
          "domain": ""
        },
        {
          "input": ["relu_output"],
          "output": ["hardswish_output"],
          "name": "hardswish_node",
          "opType": "HardSwish",
          "domain": ""
        },
        {
          "input": ["hardswish_output"],
          "output": ["tanh_output"],
          "name": "tanh_node",
          "opType": "Tanh",
          "domain": ""
        },
        {
          "input": ["tanh_output", "weights", "bias"],
          "output": ["gemm_output"],
          "name": "gemm_node",
          "opType": "Gemm",
          "attribute": [
            {
              "name": "alpha",
              "f": 1.0,
              "type": "FLOAT"
            },
            {
              "name": "beta",
              "f": 1.0,
              "type": "FLOAT"
            },
            {
              "name": "transA",
              "i": 0,
              "type": "INT"
            },
            {
              "name": "transB",
              "i": 0,
              "type": "INT"
            }
          ],
          "domain": ""
        }
      ],
      "name": "test_model",
      "initializer": [
        {
          "dims": [3, 4],
          "dataType": 1,
          "floatData": [
            0.1, 0.2, 0.3, 0.4,
            0.5, 0.6, 0.7, 0.8,
            0.9, 1.0, 1.1, 1.2
          ],
          "name": "weights"
        },
        {
          "dims": [3],
          "dataType": 1,
          "floatData": [0.1, 0.2, 0.3],
          "name": "bias"
        }
      ],
      "input": [
        {
          "name": "input_1",
          "type": {
            "tensorType": {
              "elemType": 1,
              "shape": {
                "dim": [
                  {"dimValue": "1"},
                  {"dimValue": "4"}
                ]
              }
            }
          }
        }
      ],
      "output": [
        {
          "name": "gemm_output",
          "type": {
            "tensorType": {
              "elemType": 1,
              "shape": {
                "dim": [
                  {"dimValue": "1"},
                  {"dimValue": "3"}
                ]
              }
            }
          }
        }
      ],
      "valueInfo": [
        {
          "name": "relu_output",
          "type": {
            "tensorType": {
              "elemType": 1,
              "shape": {
                "dim": [
                  {"dimValue": "1"},
                  {"dimValue": "4"}
                ]
              }
            }
          }
        },
        {
          "name": "hardswish_output",
          "type": {
            "tensorType": {
              "elemType": 1,
              "shape": {
                "dim": [
                  {"dimValue": "1"},
                  {"dimValue": "4"}
                ]
              }
            }
          }
        },
        {
          "name": "tanh_output",
          "type": {
            "tensorType": {
              "elemType": 1,
              "shape": {
                "dim": [
                  {"dimValue": "1"},
                  {"dimValue": "4"}
                ]
              }
            }
          }
        }
      ]
    },
    "opsetImport": [
      {
        "domain": "",
        "version": "15"
      }
    ]
  }